{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv1D", "config": {"name": "conv1d_1", "batch_input_shape": [null, 65, 300], "filters": 500, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1], "dtype": "float32", "kernel_regularizer": null, "dilation_rate": [1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_size": [3]}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "padding": "valid", "trainable": true, "pool_size": [2], "strides": [2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.2, "trainable": true, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "name": "lstm_1", "recurrent_regularizer": null, "use_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "unroll": false, "stateful": false, "activation": "tanh", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "return_sequences": false, "dropout": 0.2}}, "trainable": true, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.009999999776482582}}, "activation": "softmax", "units": 3}}]}